{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 128, 128, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Input_MELSPECT"}, "name": "Input_MELSPECT", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"name": "Conv_1_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "Conv_1_MELSPECT", "inbound_nodes": [[["Input_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "BatchNorm_1_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}}, "name": "BatchNorm_1_MELSPECT", "inbound_nodes": [[["Conv_1_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Activ_1_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "elu"}}}, "name": "Activ_1_MELSPECT", "inbound_nodes": [[["BatchNorm_1_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "MaxPool_1_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}}, "name": "MaxPool_1_MELSPECT", "inbound_nodes": [[["Activ_1_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Drop_1_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}}, "name": "Drop_1_MELSPECT", "inbound_nodes": [[["MaxPool_1_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Conv_2_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "Conv_2_MELSPECT", "inbound_nodes": [[["Drop_1_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "BatchNorm_2_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}}, "name": "BatchNorm_2_MELSPECT", "inbound_nodes": [[["Conv_2_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Activ_2_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "elu"}}}, "name": "Activ_2_MELSPECT", "inbound_nodes": [[["BatchNorm_2_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "MaxPool_2_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "same", "strides": [4, 4], "data_format": "channels_last"}}}, "name": "MaxPool_2_MELSPECT", "inbound_nodes": [[["Activ_2_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Drop_2_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}}, "name": "Drop_2_MELSPECT", "inbound_nodes": [[["MaxPool_2_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Conv_3_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "Conv_3_MELSPECT", "inbound_nodes": [[["Drop_2_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "BatchNorm_3_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}}, "name": "BatchNorm_3_MELSPECT", "inbound_nodes": [[["Conv_3_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Activ_3_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "elu"}}}, "name": "Activ_3_MELSPECT", "inbound_nodes": [[["BatchNorm_3_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "MaxPool_3_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "same", "strides": [4, 4], "data_format": "channels_last"}}}, "name": "MaxPool_3_MELSPECT", "inbound_nodes": [[["Activ_3_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Drop_3_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}}, "name": "Drop_3_MELSPECT", "inbound_nodes": [[["MaxPool_3_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Conv_4_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "Conv_4_MELSPECT", "inbound_nodes": [[["Drop_3_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "BatchNorm_4_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}}, "name": "BatchNorm_4_MELSPECT", "inbound_nodes": [[["Conv_4_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Activ_4_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "elu"}}}, "name": "Activ_4_MELSPECT", "inbound_nodes": [[["BatchNorm_4_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "MaxPool_4_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "same", "strides": [4, 4], "data_format": "channels_last"}}}, "name": "MaxPool_4_MELSPECT", "inbound_nodes": [[["Activ_4_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Drop_4_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}}, "name": "Drop_4_MELSPECT", "inbound_nodes": [[["MaxPool_4_MELSPECT", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Flat_MELSPECT", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}}, "name": "Flat_MELSPECT", "inbound_nodes": [[["Drop_4_MELSPECT", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "LSTM_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2}, "name": "LSTM_1", "inbound_nodes": [[["Flat_MELSPECT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "FC", "trainable": true, "dtype": "float32", "units": 8, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC", "inbound_nodes": [[["LSTM_1", 0, 0, {}]]]}], "input_layers": [["Input_MELSPECT", 0, 0]], "output_layers": [["FC", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}